# Table of content
## 1. Preparation to combine datasets
## 2. Exporting df in a pickle format

# 1. Preparation to combine datasets

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [3]:
path = r"C:\Users\Anwender\Documents\07-2023 Instacart Basket Analysis\02 Data"
# import data sets products.csv and orders.csv
df_prods = pd.read_csv(os.path.join(path, "Prepared Data", "products_checked.csv"), index_col = False)
df_ords = pd.read_csv(os.path.join(path, "Prepared Data", "orders_checked.csv"), index_col = False)
df_new = pd.read_csv(os.path.join(path, "Original Data", "order_products__prior.csv"), index_col = False)

In [4]:
#checking output
df_new.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [5]:
df_ords.head()

,Unnamed: 0,order_id,user_id,amount_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [6]:
#dropping unneeded column AGAIN
df_ords_2 = df_ords.drop(columns=["Unnamed: 0"])

In [7]:
df_ords_2

,order_id,user_id,amount_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [8]:
#checking shape of dfs
df_ords_2.shape

(3421083, 6)

In [9]:
df_ords.shape

(3421083, 7)

In [10]:
df_new.shape

(32434489, 4)

In [12]:
#merging df_new with df_ords_2
df_merged_large = df_ords_2.merge(df_new, on = 'order_id', indicator = True)

In [13]:
df_merged_large.head()

,order_id,user_id,amount_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

# 2. Exporting df in a pickle format

In [14]:
# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, 'Prepared Data', 'orders_products_combined.pkl'))

In [15]:
#checking shape of df_merged
df_merged_large.shape

(32434489, 10)